{
    "name": "Baggit - Bags, wallets, belts and more",
    "summary": "<p><strong>Baggit</strong> is a leading fashion brand with a compelling story. Committed to sustainable practices and exquisite design, Baggit offers a captivating range of bags and accessories that make a style statement while championing eco-conscious values. Explore the world of Baggit, where fashion becomes a force for good.</p>",
    "description": "<p>Welcome to Baggit, where fashion meets sustainability, and style becomes a way of expressing your values. Our journey is more than just a brand; it's a commitment to making a positive impact on the world we live in.</p><p><strong>Our Story:</strong> Founded in 1990 by Nina Lekhi, Baggit began as a dream to create fashion that reflects conscious living. Today, it stands as a testament to her vision and determination. Our brand is more than just bags; it's a symbol of ethical fashion and responsible living.</p><p><strong>The Baggit Difference:</strong> What sets Baggit apart is our unwavering commitment to sustainable and cruelty-free practices. We believe that fashion should not come at the cost of the environment or the well-being of animals. All our products are crafted from cruelty-free materials, showcasing that fashion can be compassionate.</p><p><strong>A Bag for Every Occasion:</strong> At Baggit, we offer a stunning collection of bags and accessories designed to suit every occasion and style. From elegant handbags and versatile wallets to chic backpacks and trendy clutches, our range speaks to your individuality. Each piece is a blend of contemporary design and ethical craftsmanship.</p><p><strong>Fashion with a Purpose:</strong> Beyond style, Baggit is about making a difference. We take pride in our efforts to minimize our carbon footprint, reduce waste, and contribute to a sustainable future. When you choose Baggit, you're not just choosing fashion; you're choosing a responsible way of living.</p><p><strong>Quality Assured:</strong> Quality is at the heart of Baggit. Our products are designed to be durable, functional, and fashionable. We ensure that every piece meets our stringent quality standards, so you can enjoy your Baggit accessory for years to come.</p><p>Join us in the movement towards a more sustainable and stylish future. Discover Baggit and redefine fashion as a force for good. Your style, your values, your Baggit!</p>",
    "information": "<ul><li><strong>Founder:</strong> Nina Lekhi</li><li><strong>Established:</strong> Since 1990</li><li><strong>Product Range:</strong> A wide range of bags and accessories for various occasions.</li><li><strong>Sustainability:</strong> Baggit is committed to ethical and sustainable practices.</li><li><strong>Cruelty-Free:</strong> All Baggit products are made from cruelty-free materials.</li><li><strong>Quality:</strong> Baggit products are designed for durability and functionality.</li></ul>",
    "price": null,
    "discountedPrice": null,
    "productLink": "/product/fashion/baggit",
    "actionLink": "https://track.vcommission.com/t/MTA5ODQxXzEwNjE1/",
    "actionText": "Buy from Baggit",
    "image": [
        "https://i.imgur.com/UBlm1ZA.jpeg",
        "https://i.imgur.com/Ruvkaxa.jpeg",
        "https://i.imgur.com/BApvGyw.png"
    ],
    "categories": [
        "fashion",
        "bag",
        "wallet",
        "belt"
    ],
    "properties": null,
    "similiarProducts": []
}