{
    "name": "BBLUNT - Hair care, products and more",
    "summary": "<p>Discover the world of <strong>BBLUNT</strong> - Your Ultimate Haircare Destination! BBLUNT is a prestigious brand that specializes in empowering individuals to express their unique style through their hair. With a rich heritage of excellence and a commitment to innovation, BBLUNT offers an extensive range of premium haircare products and expert salon services. Explore the art of self-expression and hair transformation with BBLUNT, where every strand tells a story.</p>",
    "description": "<p>Welcome to BBLUNT, where hair is our canvas, and self-expression is our art. Established with a passion for redefining the way we approach haircare and styling, BBLUNT has become a household name in the realm of beauty and fashion.</p><p><strong>Our Story:</strong> Our journey began with a vision to break the norms and celebrate individuality through hair. Founded by celebrated hairstylists and industry veterans - Adhuna Bhabani, Avan Contractor, and Osh Bhabani, BBLUNT has always been at the forefront of hair innovation. With a rich history dating back to 1998, our brand has continually evolved to meet the ever-changing needs and aspirations of our diverse clientele.</p><p><strong>A Range for Every Need:</strong> BBLUNT offers an extensive range of meticulously crafted haircare products designed to cater to all hair types and concerns. From nourishing shampoos and conditioners to high-performance styling products, we believe in offering the best solutions for all your hair desires. Our products are formulated with the utmost care, ensuring that each strand receives the love and attention it deserves.</p><p><strong>The Salon Experience:</strong> At BBLUNT, we're not just a brand; we're a lifestyle. Our salons are havens of creativity, where our expert stylists work their magic to bring your hair dreams to life. From classic cuts to bold colors, we understand the transformative power of a good hairstyle. Step into our world of style and let our professionals unleash your hair's full potential.</p><p><strong>Unleash Your Individuality:</strong> BBLUNT believes that every person has a unique story to tell, and your hair is a canvas for that narrative. We encourage you to embrace your individuality and showcase your personality through your hair. Whether you seek timeless elegance or avant-garde trends, BBLUNT is your partner in self-expression.</p><p><strong>Quality Assured:</strong> Quality is the cornerstone of BBLUNT's success. We meticulously select ingredients and employ cutting-edge technology to develop products that are safe, effective, and nourishing for your hair. Our commitment to quality ensures that your hair always looks and feels its best.</p><p>Join the BBLUNT movement today and embark on a journey where your hair becomes a statement of who you are. Your style, your story, your BBLUNT!</p>",
    "information": "<ul><li><strong>Founders:</strong> Adhuna Bhabani, Avan Contractor, and Osh Bhabani</li><li><strong>Established:</strong> Since 1998</li><li><strong>Product Range:</strong> Shampoos, conditioners, styling products, and more.</li><li><strong>Salon Services:</strong> Expert haircuts, coloring, styling, and personalized consultations.</li><li><strong>Individuality:</strong> BBLUNT encourages self-expression and celebrates uniqueness.</li><li><strong>Quality:</strong> All BBLUNT products are formulated with high-quality ingredients and innovation.</li></ul>",
    "price": null,
    "discountedPrice": null,
    "productLink": "/product/cosmetics/hair/bblunt",
    "actionLink": "https://track.vcommission.com/t/MTA5ODQxXzEwNjM0/",
    "actionText": "Buy from BBLUNT",
    "image": [
        "https://i.imgur.com/n8piaUd.jpeg",
        "https://i.imgur.com/ALLJjCx.png",
        "https://i.imgur.com/fefd49c.png",
        "https://i.imgur.com/HIWeWzK.png"
    ],
    "categories": [
        "cosmetics",
        "hair"
    ],
    "properties": {
        "colors": [],
        "sizes": []
    },
    "similiarProducts": []
}